Part of the riser lies on the boundary is not allowed.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId PartOfRiserLiesOnBoundaryFailure { get; }
  Visual Basic
Public Shared ReadOnly Property PartOfRiserLiesOnBoundaryFailure As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ PartOfRiserLiesOnBoundaryFailure {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures StairRampFailures Class
  Autodesk.Revit.DB Namespace